module.exports.config = {
name: "chuctet",
version: "1.0.0",
hasPermssion: 0,
credits: "Trankhuong",
description: "𝑻𝒂𝒈 𝒏𝒈𝒖̛𝒐̛̀𝒊 𝒎𝒂̀ 𝒃𝒂̣𝒏 𝒎𝒖𝒐̂́𝒏 𝒄𝒉𝒖́𝒄 𝒕𝒆̂́𝒕",
commandCategory: "Tiện ích",
usages: "",
cooldowns: 90,
dependencies: {
"fs-extra": "",
"axios": ""
}
}

module.exports.run = async function({ api, args, Users, event}) {
var mention = Object.keys(event.mentions)[0];
if(!mention) return api.sendMessage("⚡𝑩𝒂̣𝒏 𝒑𝒉𝒂̉𝒊 𝒕𝒂𝒈 𝒏𝒈𝒖̛𝒐̛̀𝒊 𝒎𝒂̀ 𝒃𝒂̣𝒏 𝒎𝒖𝒐̂́𝒏 𝒄𝒉𝒖́𝒄 𝒕𝒆̂́𝒕!", event.threadID);
let name = event.mentions[mention];
var arraytag = [];
arraytag.push({id: mention, tag: name});
var a = function (a) { api.sendMessage(a, event.threadID); }
a("🌸𝑵𝒂̆𝒎 𝒎𝒐̛́𝒊 𝒕𝒆̂́𝒕 đ𝒆̂́𝒏 𝒎𝒊̀𝒏𝒉 𝒙𝒊𝒏 𝒈𝒖̛̉𝒊 đ𝒆̂́𝒏 𝒃𝒂̣𝒏 𝒏𝒉𝒖̛̃𝒏𝒈 𝒄𝒂̂𝒖 𝒄𝒉𝒖́𝒄 𝒕𝒉𝒂̣̂𝒕 𝒍𝒂̀ 𝒚́ 𝒏𝒈𝒉𝒊̃𝒂 𝒗𝒂̀ 𝒏𝒈𝒐̣𝒕 𝒏𝒈𝒂̀𝒐 đ𝒆̂́𝒏 𝒗𝒐̛́𝒊 𝒃𝒂̣𝒏 𝒎𝒐𝒏𝒈 𝒃𝒂̣𝒏 đ𝒐́𝒏 𝒏𝒉𝒂̣̂𝒏 𝒏𝒉𝒆́!");
setTimeout(() => {a({body: "🎋 𝑪𝒉𝒖́𝒄 𝒃𝒂̣𝒏 𝒔𝒐̂́𝒏𝒈 𝒌𝒉𝒐̉𝒆 𝒏𝒉𝒖̛ 𝒕𝒓𝒂̂𝒖, 𝒔𝒐̂́𝒏𝒈 𝒅𝒂𝒊 𝒏𝒉��̛ đ𝒊̉𝒂, 𝒔𝒐̂́𝒏𝒈 𝒍𝒂̂𝒖 𝒏𝒉𝒖̛ 𝒓𝒖̀𝒂 𝒏𝒉𝒆́!" + " " + name, mentions: arraytag})} , 9000);
setTimeout(() => {a({body: "🎋 𝑪𝒉𝒖́𝒄 𝒃𝒂̣𝒏 𝒉𝒂𝒚 𝒂̆𝒏 𝒄𝒉𝒐́𝒏𝒈 𝒃𝒆́𝒐, 𝒕𝒊𝒆̂̀𝒏 𝒏𝒉𝒊𝒆̂̀𝒖 𝒏𝒉𝒖̛ 𝒌𝒆̣𝒐, 𝒕𝒊̀𝒏𝒉 𝒄𝒉𝒂̣̆𝒕 𝒏𝒉𝒖̛ 𝒌𝒆𝒐, 𝒅𝒆̉𝒐 𝒅𝒂𝒊 𝒏𝒉𝒖̛ 𝒎𝒆̀𝒐, 𝒎𝒊̣𝒏 𝒎𝒂̀𝒏𝒈 𝒕𝒓𝒂̆́𝒏𝒈 𝒕𝒓𝒆̉𝒐, 𝒔𝒖̛́𝒄 𝒌𝒉𝒐̉𝒆 𝒏𝒉𝒖̛ 𝒗𝒐𝒊 𝒏𝒉𝒆́!" + " " + name, mentions: arraytag})} , 10000);
setTimeout(() => {a({body: "🎋 𝑪𝒉𝒖́𝒄 𝒃𝒂̣𝒏 𝒏𝒂̆𝒎 𝒎𝒐̛́𝒊 - 𝒗𝒂̣𝒏 𝒔𝒖̛̣ 𝒏𝒉𝒖̛ 𝒚́ - 𝒔𝒊𝒏𝒉 𝒍𝒚́ 𝒅𝒐̂̀𝒊 𝒅𝒂̀𝒐 - 𝒗𝒂̀𝒏𝒈 𝒗𝒂̀𝒐 𝒄𝒂̉ 𝒌𝒚́ - 𝒕𝒊𝒆̂̀𝒏 𝒓𝒂 𝒕𝒊 𝒕𝒊́ - 𝒕𝒉𝒂̣̂𝒕 𝒍𝒂̀ 𝒉𝒆̂́𝒕 𝒚́ 𝒏𝒉𝒆́!" + " " + name, mentions: arraytag})} , 20000);
setTimeout(() => {a({body: "🎋 𝑶̂𝒊 𝒃𝒂̣𝒏 𝒚𝒆̂�� 𝒄𝒖̉𝒂 𝒕𝒐̂𝒊 𝒐̛𝒊. 𝑵𝒂̆𝒎 𝒉𝒆̂́𝒕, 𝑻𝒆̂́𝒕 đ𝒆̂́𝒏, 𝒕𝒐̂𝒊 𝒕𝒉𝒂̣̂𝒕 𝒍𝒐̀𝒏𝒈 𝒎𝒐𝒏𝒈 𝒃𝒂̣𝒏 𝒔𝒐̛́𝒎 𝒕𝒓𝒐̛̉ 𝒕𝒉𝒂̀𝒏𝒉 𝒏𝒈𝒖̛𝒐̛̀𝒊 𝒍𝒖̛𝒐̛𝒏𝒈 𝒕𝒉𝒊𝒆̣̂𝒏 𝒃𝒐̛̉𝒊 𝒏𝒂̆𝒎 𝒒𝒖𝒂 𝒃𝒂̣𝒏 𝒕𝒂̣𝒐 𝒏𝒈𝒉𝒊𝒆̣̂𝒑 𝒉𝒐̛𝒊 𝒏𝒉𝒊𝒆̂̀𝒖 𝒓𝒐̂̀𝒊 đ𝒂̂́𝒚. 𝑵𝒆̂́𝒖 𝒌𝒉𝒐̂𝒏𝒈 𝒍𝒂̀𝒎 đ𝒖̛𝒐̛̣𝒄 𝒕𝒉𝒊̀ 𝒂𝒏𝒉 𝒆𝒎 𝒄𝒉𝒖́𝒏𝒈 𝒕𝒐̂𝒊 𝒔𝒂̆̃𝒏 𝒔𝒂̀𝒏𝒈 𝒄𝒉𝒖𝒏𝒈 𝒔𝒖̛́𝒄 𝒅𝒊𝒆̣̂𝒕 𝒃𝒂̣𝒏 đ𝒆̂̉ 𝒃𝒂̉𝒐 𝒗𝒆̣̂ 𝒔𝒖̛̣ 𝒚𝒆̂𝒏 𝒃𝒊̀𝒏𝒉 𝒄𝒉𝒐 𝒙𝒂̃ 𝒉𝒐̣̂𝒊. 𝑯𝒂𝒉𝒂." + " " + name, mentions: arraytag})} , 30000);
setTimeout(() => {a({body: "🎋 𝑵𝒈𝒖̛𝒐̛̀𝒊 𝒕𝒉𝒂̀𝒏𝒉 𝒄𝒐̂𝒏𝒈 𝒕𝒉𝒖̛𝒐̛̀𝒏𝒈 đ𝒐̛𝒏 đ𝒐̣̂𝒄, 𝒗𝒂̣̂𝒚 𝒏𝒆̂𝒏 𝒏𝒂̆𝒎 𝒎𝒐̛́𝒊 𝒄𝒉𝒖́�� 𝒃𝒂̣𝒏 𝒕𝒊𝒆̂́𝒑 𝒕𝒖̣𝒄 𝒄𝒐̂ đ𝒐̛𝒏 𝒏𝒉𝒆́, 𝒏𝒉𝒖̛ 𝒗𝒂̣̂𝒚 𝒎𝒐̛́𝒊 𝒔𝒐̛́𝒎 𝒈𝒊𝒂̀𝒖 đ𝒖̛𝒐̛̣𝒄. 𝒀𝒆̂𝒖 đ𝒖̛𝒐̛𝒏𝒈 𝒈𝒊̀ 𝒕𝒂̂̀𝒎 𝒏𝒂̀𝒚, 𝒃𝒖𝒐̂̀𝒏 𝒑𝒉𝒊𝒆̂̀𝒏 đ𝒂̃ 𝒄𝒐́ 𝒂𝒏𝒉 𝒆𝒎, 𝒕𝒉𝒆̂́ 𝒏𝒉𝒆́!" + " " + name, mentions: arraytag})} , 40000);
setTimeout(() => {a({body: "🎋 𝑴𝒐̣̂𝒕 𝒏𝒂̆𝒎 𝒎𝒐̛́𝒊 𝒗𝒖𝒊 𝒗𝒆̉, 𝒕𝒉𝒆̂𝒎 𝒕𝒖̛𝒐̛𝒊 𝒕𝒓𝒆̉, 𝒍𝒖𝒐̂𝒏 𝒎𝒐̛́𝒊 𝒎𝒆̉, 𝒄𝒂̀𝒏𝒈 𝒎𝒂̣𝒏𝒉 𝒌𝒉𝒐̉𝒆. 𝑨̀... 𝑳𝒖𝒐̂𝒏 𝒔𝒂̣𝒄𝒉 𝒔𝒆̃. 𝑲𝒉𝒐̂𝒏𝒈 𝒄𝒐́... 𝒈𝒉𝒆̉ 𝒏𝒉𝒆́!" + " " + name, mentions: arraytag})} , 50000);
setTimeout(() => {a({body: "🎋 𝑵𝒂̆𝒎 𝒎𝒐̛́𝒊, 𝒄𝒉𝒖́𝒄 𝒃𝒂̣𝒏 𝟒 𝒄𝒉𝒖̛̃ 𝒗𝒂̀𝒏𝒈 đ𝒆̂̉ 𝒔𝒐̂́𝒏𝒈:\n𝑺𝒐̂́𝒏𝒈 𝒄𝒉𝒐 𝒍𝒆̃ 𝑷𝑯𝑨̉𝑰\n𝑺𝒐̂́𝒏𝒈 𝒄𝒉𝒐 𝒄𝒉𝒂̂𝒏 𝑻𝑯𝑨̣̂𝑻\n𝑺𝒐̂́𝒏𝒈 𝒃𝒊𝒆̂́𝒕 𝒌𝒊𝒆̂𝒏 𝑵𝑯𝑨̂̃𝑵\n𝑺𝒐̂́𝒏𝒈 𝒃𝒂̆̀𝒏𝒈 𝒍𝒖̛𝒐̛𝒏𝒈 𝑻𝑨̂𝑴.\n\n𝑻𝒐́𝒎 𝒍𝒂̣𝒊 𝒍𝒂̀ : 𝑷𝑯𝑨̉𝑰 𝑻𝑯𝑨̣̂𝑻 𝑵𝑯𝑨̂̃𝑵 𝑻𝑨̂𝑴" + " " + name, mentions: arraytag})} , 60000);
setTimeout(() => {a({body: "🎋 𝑴𝒐𝒏𝒈 𝒃𝒂̣𝒏 𝒔𝒆̃ đ𝒐́𝒏 𝒏𝒉𝒂̣̂𝒏 𝒏𝒉𝒖̛̃𝒏𝒈 𝒄𝒂̂𝒖 𝒄𝒉𝒖́𝒄 𝒏𝒂̀𝒚 𝒄𝒖̉𝒂 𝒎𝒊̀𝒏𝒉, 𝑪𝒉𝒖́𝒄 𝒃𝒂̣𝒏 𝒏𝒂̆𝒎 𝒎𝒐̛́𝒊 𝒗𝒖𝒊 𝒗𝒆̉!\n🎇🧨𝑯𝒂𝒑𝒑𝒚 𝑵𝒆𝒘 𝒀𝒆𝒂𝒓! ❤️" + " " + name, mentions: arraytag})} , 70000);
  }